## 2- Qual o Número de Títulos Por Gênero?

In [2]:
# Imports
import re
import time
import sqlite3
import pycountry
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
from matplotlib import cm
from sklearn.feature_extraction.text import CountVectorizer
import warnings
warnings.filterwarnings("ignore")
sns.set_theme(style = "whitegrid")
conn = sqlite3.connect("imdb.db")

In [4]:
consulta = "SELECT genres, COUNT(*) FROM titles WHERE type = 'movie' GROUP BY genres" 
resultado = pd.read_sql_query(consulta, conn)
display(resultado)

                      genres  COUNT(*)
0                     Action     13276
1               Action,Adult        11
2     Action,Adult,Adventure         1
3        Action,Adult,Comedy         5
4         Action,Adult,Crime        10
...                      ...       ...
1439        Thriller,Western        37
1440                     War      1249
1441             War,Western         9
1442                 Western      4036
1443                      \N     70538

[1444 rows x 2 columns]